; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=36, out_folder=htg/blocksworld/training, instance_id=16, seed=2040, goal_proportion=0.1

(define (problem blocksworld-16)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 - object)
 (:init 
    (arm-empty)
    (clear b14)
    (on b14 b7)
    (on b7 b21)
    (on b21 b35)
    (on-table b35)
    (clear b10)
    (on-table b10)
    (clear b23)
    (on b23 b4)
    (on b4 b9)
    (on b9 b5)
    (on b5 b11)
    (on b11 b1)
    (on b1 b16)
    (on b16 b36)
    (on b36 b13)
    (on-table b13)
    (clear b30)
    (on b30 b20)
    (on-table b20)
    (clear b18)
    (on-table b18)
    (clear b19)
    (on b19 b28)
    (on b28 b3)
    (on b3 b15)
    (on-table b15)
    (clear b8)
    (on-table b8)
    (clear b24)
    (on b24 b2)
    (on b2 b31)
    (on-table b31)
    (clear b26)
    (on-table b26)
    (clear b6)
    (on b6 b12)
    (on b12 b17)
    (on b17 b29)
    (on b29 b33)
    (on b33 b27)
    (on-table b27)
    (clear b34)
    (on b34 b32)
    (on-table b32)
    (clear b22)
    (on b22 b25)
    (on-table b25))
 (:goal  (and 
    (clear b3)
    (on b3 b2)
    (on b2 b1)
    (on-table b1))))

; plan
1. (unstack b19 b28)
   deleted: (on b19 b28) (clear b19) (arm-empty)
   added: (holding b19) (clear b28)
   goals met: 0 of 4
2. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 4
3. (unstack b28 b3)
   deleted: (on b28 b3) (clear b28) (arm-empty)
   added: (holding b28) (clear b3)
   goals met: 1 of 4
4. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 1 of 4
5. (unstack b24 b2)
   deleted: (on b24 b2) (clear b24) (arm-empty)
   added: (holding b24) (clear b2)
   goals met: 1 of 4
6. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 1 of 4
7. (unstack b3 b15)
   deleted: (on b3 b15) (clear b3) (arm-empty)
   added: (holding b3) (clear b15)
   goals met: 0 of 4
8. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 2 of 4
9. (unstack b23 b4)
   deleted: (on b23 b4) (clear b23) (arm-empty)
   added: (holding b23) (clear b4)
   goals met: 2 of 4
10. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 2 of 4
11. (unstack b4 b9)
   deleted: (on b4 b9) (clear b4) (arm-empty)
   added: (holding b4) (clear b9)
   goals met: 2 of 4
12. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 4
13. (unstack b9 b5)
   deleted: (on b9 b5) (clear b9) (arm-empty)
   added: (holding b9) (clear b5)
   goals met: 2 of 4
14. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 2 of 4
15. (unstack b5 b11)
   deleted: (on b5 b11) (clear b5) (arm-empty)
   added: (holding b5) (clear b11)
   goals met: 2 of 4
16. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 2 of 4
17. (unstack b11 b1)
   deleted: (on b11 b1) (clear b11) (arm-empty)
   added: (holding b11) (clear b1)
   goals met: 2 of 4
18. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 4
19. (unstack b1 b16)
   deleted: (on b1 b16) (clear b1) (arm-empty)
   added: (holding b1) (clear b16)
   goals met: 2 of 4
20. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 4
21. (unstack b3 b2)
   deleted: (on b3 b2) (clear b3) (arm-empty)
   added: (holding b3) (clear b2)
   goals met: 1 of 4
22. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 4
23. (unstack b2 b31)
   deleted: (on b2 b31) (clear b2) (arm-empty)
   added: (holding b2) (clear b31)
   goals met: 2 of 4
24. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 3 of 4
25. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 2 of 4
26. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 4 of 4
